---
kind: type
id: T:Autodesk.Revit.DB.Structure.TrussType
source: html/6c8c06d7-14a0-a286-8c15-7391d67579a5.htm
---
# Autodesk.Revit.DB.Structure.TrussType

Represents a specific type of truss.

## Syntax (C#)
```csharp
public class TrussType : FamilySymbol
```